Autodesk.Revit.DB.FamilyParameter.GetUnitTypeId
Gets the identifier of the unit quantifying the parameter value.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if this parameter is not of value type.